# St7SetPlateLighting

Sets the state of the Lighting options for plate rendering.

long St7SetPlateLighting(long uID, bool FillLighting, bool LineLighting)
Input Parameters
uID
Strand7 model file ID.
FillLighting
The lighting option for plate fill; either True or False.
LineLighting
The lighting option for plate outlines; either True or False.